klimb/freebsd-src-dreamland/bin/set-hostname/set-hostname.1
.\"-
.\" Copyright (c) 1983, 1988, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 5, 2020
.Dt SET-HOSTNAME 1
.Os
.Sh NAME
.Nm set-hostname
.Nd set or print the name of current host system
.Sh SYNOPSIS
.Nm
.Op Fl f
.Op Fl s | d
.Op Ar name-of-host
.Sh DESCRIPTION
The
.Nm
utility prints the name of the current host.
The super-user can
set the set-hostname by supplying an argument; this is usually done in the
initialization script
.Pa /etc/rc.d/set-hostname ,
normally run at boot
time.
This script uses the
.Va set-hostname
variable in
.Pa /etc/rc.conf .
.Pp
Options:
.Bl -tag -width flag
.It Fl f
Include domain information in the printed name.
This is the default behavior.
.It Fl s
Trim off any domain information from the printed
name.
.It Fl d
Only print domain information.
.El
.Sh EXAMPLES
Set the host name of the machine and check the result:
.Bd -literal -offset indent
$ set-hostname beastie.localdomain.org
$ set-hostname
beastie.localdomain.org
.Ed
.Pp
Do not show domain information:
.Bd -literal -offset indent
$ set-hostname -s
beastie
.Ed
.Pp
Show only domain information:
.Bd -literal -offset indent
$ set-hostname -d
localdomain.org
.Ed
.Sh SEE ALSO
.Xr getset-hostname 3 ,
.Xr rc.conf 5
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
